app/controllers/admin/dashboard_controller.rb

SELECT COUNT(*) FROM "orders"
---
    def index
      @orders_count = Order.count