app/views/users/show.html.erb

SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
                  <ul class="list-group list-group-flush">
                    <% order.items.each do |item| %>

SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 40]]
SELECT SUM("items"."price") FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 1]]
---
                      <strong>Total</strong>
                      <strong><%= number_to_currency(order.items.sum(:price)) %></strong>