app/views/orders/show.html.erb

SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 4]]
---
<ul>
  <% @order.items.each do |item| %>

SELECT "items".* FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 4]]
SELECT SUM("items"."price") FROM "items" INNER JOIN "order_items" ON "items"."id" = "order_items"."item_id" WHERE "order_items"."order_id" = $1  [["order_id", 4]]
---

<p>Total: <%= number_to_currency(@order.items.sum(:price)) %></p>