app/views/carts/show.html.erb


<% if @cart.items.any? %>
---
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 45]]