app/controllers/carts_controller.rb

  def confirm_order
    @cart = current_user.cart
    if @cart.items.any?
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]