app/controllers/carts_controller.rb

  def show
    @cart = current_user.cart
    @cart_items = @cart.cart_items
    @total_price = @cart.items.sum(&:price)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 45]]

  def add_item
    @cart = current_user.cart || current_user.create_cart
    item = Item.find(params[:item_id])
    @cart.items << item
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "cart_items" ("cart_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cart_id", 45], ["item_id", 2], ["created_at", "2024-05-28 14:14:24.795569"], ["updated_at", "2024-05-28 14:14:24.795569"]]

  def remove_item
    @cart = current_user.cart
    item = Item.find(params[:item_id])
    @cart.items.delete(item)
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2  [["cart_id", 45], ["item_id", 2]]

  def confirm_order
    @cart = current_user.cart
    if @cart.items.any?
      order = current_user.orders.create
      @cart.items.each do |item|
        order.order_items.create(item: item)
      end
      @cart.items.clear
---
SELECT "items".* FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1  [["cart_id", 45]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "items" INNER JOIN "cart_items" ON "items"."id" = "cart_items"."item_id" WHERE "cart_items"."cart_id" = $1 LIMIT $2  [["cart_id", 45], ["LIMIT", 1]]
INSERT INTO "orders" ("user_id", "created_at", "updated_at", "total_price", "status") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["created_at", "2024-05-30 14:51:11.452501"], ["updated_at", "2024-05-30 14:51:11.452501"], ["total_price", nil], ["status", nil]]
INSERT INTO "order_items" ("order_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["order_id", 2], ["item_id", 2], ["created_at", "2024-05-28 14:15:42.151437"], ["updated_at", "2024-05-28 14:15:42.151437"]]
DELETE FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" IN ($2, $3, $4)  [["cart_id", 45], ["item_id", 2], ["item_id", 2], ["item_id", 3]]