app/controllers/checkout_controller.rb

  def success
    @session = Stripe::Checkout::Session.retrieve(params[:session_id])
    @payment_intent = Stripe::PaymentIntent.retrieve(@session.payment_intent)
    @order_id = @session.metadata.order_id
    @order = Order.find(@order_id)
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]