app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @orders = @user.orders
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]