app/models/user.rb

  def create_cart
    self.create_cart!
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2024-05-28 11:38:05.222086"], ["updated_at", "2024-05-28 11:38:05.222086"]]