app/views/layouts/_nav.html.erb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 64], ["LIMIT", 1]]
---
                    <!-- Afficher "Mon profil" et "Déconnexion" si l'utilisateur est connecté -->
                    <% if current_user.cart.present? %>

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
          </li>
          <% if current_user.cart.present? %>